In [1]:
import pandas as pd

In [2]:
bios=pd.read_csv("./data/bios.csv")

In [3]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [4]:
bios["born_city"].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Bodrogkisfalud        1
Ternberg              1
Klaus                 1
Plaški                1
Dulwich Hill          1
Name: count, Length: 22368, dtype: int64

In [5]:
bios[bios["born_country"]=='USA']['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Pennsylvania             530
Massachusetts            530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
South Carolina            50
Maine                     50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [7]:
coffee=pd.read_csv("./warmup-data/coffee.csv")

In [10]:
coffee["price"]=10

In [8]:
coffee.groupby(["Coffee Type"])["Units Sold"].sum()

Coffee Type
Espresso    265
Latte       195
Name: Units Sold, dtype: int64

In [9]:
coffee.groupby(["Coffee Type"])["Units Sold"].mean()

Coffee Type
Espresso    37.857143
Latte       27.857143
Name: Units Sold, dtype: float64

In [14]:
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25     10
1     Monday       Latte          15     10
2    Tuesday    Espresso          30     10
3    Tuesday       Latte          20     10
4  Wednesday    Espresso          35     10

In [12]:
coffee.groupby(["Coffee Type"]).agg({"Units Sold":"sum","price":'mean'})

             Units Sold  price
Coffee Type
Espresso            265   10.0
Latte               195   10.0

In [15]:
coffee.groupby(["Coffee Type","Day"]).agg({"Units Sold":"sum","price":'mean'})

                       Units Sold  price
Coffee Type Day
Espresso    Friday             45   10.0
            Monday             25   10.0
            Saturday           45   10.0
            Sunday             45   10.0
            Thursday           40   10.0
            Tuesday            30   10.0
            Wednesday          35   10.0
Latte       Friday             35   10.0
            Monday             15   10.0
            Saturday           35   10.0
            Sunday             35   10.0
            Thursday           30   10.0
            Tuesday            20   10.0
            Wednesday          25   10.0

In [16]:
coffee

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25     10
1      Monday       Latte          15     10
2     Tuesday    Espresso          30     10
3     Tuesday       Latte          20     10
4   Wednesday    Espresso          35     10
5   Wednesday       Latte          25     10
6    Thursday    Espresso          40     10
7    Thursday       Latte          30     10
8      Friday    Espresso          45     10
9      Friday       Latte          35     10
10   Saturday    Espresso          45     10
11   Saturday       Latte          35     10
12     Sunday    Espresso          45     10
13     Sunday       Latte          35     10

In [17]:
coffee["revenue"]=coffee["Units Sold"]*coffee["price"]

In [18]:
pivot=coffee.pivot(columns='Coffee Type',index="Day",values="revenue")

In [19]:
pivot

Coffee Type  Espresso  Latte
Day
Friday            450    350
Monday            250    150
Saturday          450    350
Sunday            450    350
Thursday          400    300
Tuesday           300    200
Wednesday         350    250

In [20]:
 pivot.loc["Monday","Latte"]

150

In [21]:
pivot.sum()

Coffee Type
Espresso    2650
Latte       1950
dtype: int64

In [22]:
pivot.sum(axis=1)

Day
Friday       800
Monday       400
Saturday     800
Sunday       800
Thursday     700
Tuesday      500
Wednesday    600
dtype: int64

In [24]:
bios["born_date"]=pd.to_datetime(bios["born_date"])

In [26]:
bios.groupby(bios["born_date"].dt.year)["name"].count()

born_date
1828.0      1
1831.0      2
1833.0      1
1836.0      1
1837.0      1
         ...
2005.0    163
2006.0     17
2007.0      3
2008.0      3
2009.0      1
Name: name, Length: 177, dtype: int64

In [27]:
bios.groupby(bios["born_date"].dt.year)["name"].count().reset_index().sort_values("name")

     born_date  name
0       1828.0     1
12      1845.0     1
10      1843.0     1
6       1839.0     1
5       1838.0     1
..         ...   ...
137     1970.0  2174
138     1971.0  2205
140     1973.0  2216
152     1985.0  2227
139     1972.0  2231

[177 rows x 2 columns]